#:set ft=ruby
cask_args appdir: "/Applications"

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'thoughtbot/formulae'

brew 'git-crypt'
brew 'fish'
brew 'rcm'
brew 'tmux'
brew 'neovim'
brew 'encfs'

cask 'font-ibm-plex'
cask 'alacritty'
cask 'vimr'
cask 'bitwarden'
cask 'brave-browser'
cask 'dropbox'
cask 'calibre'
cask 'zotero'
cask 'dash'
