# Source the base Brewfile first
eval_file "#{ENV['HOME']/.Brewfile-base}"

# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Git extension for versioning large files
brew "git-lfs"
# Kubernetes package manager
brew "helm"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Log analyzer for PostgreSQL
brew "pgbadger"
# Tensors and dynamic neural networks
brew "pytorch"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Command-line client for WebSockets
brew "websocat"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
