tap "boz/repo"
tap "homebrew/bundle"
tap "homeport/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# C library for files containing sampled sound
brew "libsndfile"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Git extension for versioning large files
brew "git-lfs"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Kubernetes package manager
brew "helm"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# LLVM's OpenMP runtime library
brew "libomp"
# Postgres C API library
brew "libpq"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Log analyzer for PostgreSQL
brew "pgbadger"
# Tensors and dynamic neural networks
brew "pytorch"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Command-line client for WebSockets
brew "websocat"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox@developer-edition"
# Screenshot software
cask "flameshot"
# Kubernetes IDE
cask "freelens"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
cask "lens"
# App to manage software development and track bugs
cask "linear-linear"
# Screen and video recording software
cask "loom"
# File system integration
cask "macfuse"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# IDE dedicated to high-quality Kubernetes YAML configurations
cask "monokle"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Run LLMs locally
cask "msty"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Pomodoro desktop timer
cask "tomighty"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "janisdd.vscode-edit-csv"
vscode "jeanp413.open-remote-ssh"
vscode "mechatroner.rainbow-csv"
vscode "mitchdenny.ecdc"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.vscode-yaml"
vscode "subframe7536.theme-maple"
vscode "vmware.vscode-concourse"
vscode "vscodevim.vim"
