jethrokuan/z
patrickf1/fzf.fish
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-foreign-env
pure-fish/pure
jhillyerd/plugin-git
jorgebucaran/fisher
oh-my-fish/plugin-pbcopy
