tap "morantron/tmux-fingers"

# ── Bootstrap / git ───────────────────────────────────────────────────────────
# Must exist before mise runs. stow/git-crypt bootstrap the dotfiles themselves.
brew "stow"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "pinentry-mac"

# ── Shell ─────────────────────────────────────────────────────────────────────
# fish must be Homebrew-installed so it can be set as login shell via chsh.
brew "fish"

# ── Terminal multiplexer ──────────────────────────────────────────────────────
# tmux and tmux-fingers stay in Homebrew: the tmux-fingers tap formula provides
# the pre-built binary that TPM links against on macOS.
brew "tmux"
brew "tmux-fingers"

# ── macOS-specific ────────────────────────────────────────────────────────────
# ── CLI tools not in mise/aqua ─────────────────────────────────────
brew "lf"        # terminal file manager (not in aqua registry)
brew "tig"       # text-mode git log/diff browser (not in aqua registry)

brew "mas"       # Mac App Store CLI (needed for mas entries below)

# ── Native compiled dependencies ──────────────────────────────────────────────
# Libraries that Python/other packages link against at the C level.
# mise provides cross-platform binaries but not .dylib / header files.
brew "libpq"     # PostgreSQL client lib (psycopg2, asyncpg, etc.)
brew "ffmpeg"    # Audio/video processing

# ── Tap-specific formulae ─────────────────────────────────────────────────────
# Not available in the aqua registry; must stay in Homebrew.
brew "boz/repo/kail"   # Kubernetes log tail

# ── Desktop apps ──────────────────────────────────────────────────────────────
cask "appcleaner"
cask "audacity"
cask "bruno"
cask "calibre"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "firefox@developer-edition"
cask "freelens"
cask "linear-linear"
cask "loom"
cask "macfuse"
cask "megasync"
cask "mounty"
cask "pycharm-ce"
cask "tomighty"
cask "vlc"
cask "vscodium"
cask "zotero"
cask "jan"

# ── VSCodium extensions ───────────────────────────────────────────────────────
vscode "janisdd.vscode-edit-csv"
# vscode "jeanp413.open-remote-ssh"
vscode "mechatroner.rainbow-csv"
vscode "mitchdenny.ecdc"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.vscode-yaml"
vscode "subframe7536.theme-maple"
vscode "vmware.vscode-concourse"
vscode "vscodevim.vim"

# ── Mac App Store ─────────────────────────────────────────────────────────────
mas "Pixelmator", id: 407_963_104
