# ── Bootstrap / git ───────────────────────────────────────────────────────────
# Must exist before mise runs. stow/git-crypt bootstrap the dotfiles themselves.
brew "stow"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "pinentry-mac"

# ── Shell ─────────────────────────────────────────────────────────────────────
# fish must be Homebrew-installed so it can be set as login shell via chsh.
brew "fish"

# ── macOS-specific ────────────────────────────────────────────────────────────
# ── CLI tools not in mise/aqua ─────────────────────────────────────
brew "lf"        # terminal file manager (not in aqua registry)
brew "tig"       # text-mode git log/diff browser (not in aqua registry)
brew "d2"        # modern diagram scripting language (not in mise)
brew "wireguard-tools"
brew "websocat"   # WebSocket tool
brew "pstree"     # process tree viewer


# ── Native compiled dependencies ──────────────────────────────────────────────
# Libraries that Python/other packages link against at the C level.
# mise provides cross-platform binaries but not .dylib / header files.
brew "libpq"     # PostgreSQL client lib (psycopg2, asyncpg, etc.)
brew "ffmpeg"    # Audio/video processing

# ── Desktop apps ──────────────────────────────────────────────────────────────
cask "appcleaner"
cask "audacity"
cask "bruno"
cask "calibre"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "firefox@developer-edition"
cask "freelens"
cask "linear"
cask "loom"
cask "macfuse"
cask "megasync"
cask "mounty"
cask "pycharm"
cask "tomighty"
cask "vlc"
cask "vscodium"
cask "zotero"
cask "jan"
cask "notion"
cask "gpg-suite"            # GPG key management GUI
cask "httpie-desktop"       # REST/GraphQL API testing client
cask "readest"              # EPUB ebook reader
cask "signal"               # Secure messaging
cask "libreoffice"          # Office suite
cask "microsoft-teams"      # Work messaging
cask "monokle"              # Kubernetes config UI
cask "mouseless"            # Keyboard-driven mouse

# ── VSCodium extensions ─────────────────────────────────────────────────────
# Canonical list: os/wsl/windows/vscodium/extensions.txt
# bootstrap.sh ensure_vscodium_extensions() installs from that file on all platforms.


# ── Mac App Store ─────────────────────────────────────────────────────────────
mas "Pixelmator", id: 407_963_104
mas "WhatsApp Messenger", id: 310_633_997
