# VSCodium extensions — canonical list, all platforms.
# macOS: bootstrap.sh ensure_vscodium_extensions() installs via codium CLI.
# Windows/WSL: up.sh installs via codium.cmd --install-extension.

# WSL remote — runs VSCodium server inside WSL2 so filesystem watching
# and git both use native Linux APIs instead of Windows stubs.
jeanp413.open-remote-wsl

# Editor
vscodevim.vim
subframe7536.theme-maple

# Python
ms-python.python
ms-python.debugpy
ms-python.black-formatter
ms-python.isort
ms-python.mypy-type-checker
ms-python.autopep8
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Git
# Added during mbpm3 audit (Jun 2026)
eamodio.gitlens

# Kubernetes
ms-kubernetes-tools.vscode-kubernetes-tools

# Terraform
hashicorp.terraform

# Data / markup
janisdd.vscode-edit-csv
mechatroner.rainbow-csv
mitchdenny.ecdc
redhat.vscode-yaml
vmware.vscode-concourse
tamasfe.even-better-toml
darkriszty.markdown-table-prettify

# Remote
jeanp413.open-remote-ssh

# Visualisation
mermaidchart.vscode-mermaid-chart
terrastruct.d2
