# VSCodium extensions — x13yg2 (Windows)
# Installed by up.sh via codium.cmd --install-extension
# Keep in sync with hosts/mbpm3/brew/.Brewfile-host vscode entries.

# Editor
vscodevim.vim
subframe7536.theme-maple

# Python
ms-python.python
ms-python.debugpy
ms-python.black-formatter
ms-python.isort
ms-python.mypy-type-checker
ms-python.autopep8
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Data / markup
janisdd.vscode-edit-csv
mechatroner.rainbow-csv
mitchdenny.ecdc
redhat.vscode-yaml
vmware.vscode-concourse
